[
  {
    "id": "e668c34e-a170-40ec-b835-4de230eeb466",
    "titulo": "Entendendo Algoritmos",
    "autor": "Aditya Y. Bhargava",
    "categoria": "universitario",
    "descricao": "O livro Entendendo Algoritmos apresenta uma abordagem agradável para esse tópico essencial da ciência da computação. Nele, você aprenderá como aplicar algoritmos comuns nos problemas de programação enfrentados diariamente. Você começará com tarefas básicas como a ordenação e a pesquisa. Com a prática, você enfrentará problemas mais complexos, como a compressão de dados e a inteligência artificial. Cada exemplo é apresentado em detalhes e inclui diagramas e códigos completos em Python. Ao final deste livro, você terá dominado algoritmos amplamente aplicáveis e saberá quando e onde utilizá-los.",
    "img": "https://m.media-amazon.com/images/I/71Vkg7GfPFL._SY425_.jpg",
    "disponibilidade": false,
    "create_at": "2024-11-18T18:46:19.022Z",
    "update_at": "2024-11-26T16:09:26.639Z"
  },
  {
    "id": "24979843-e51f-43ed-b759-7793e293e37a",
    "titulo": "O poder do hábito: Não Aplica",
    "autor": "Charles Duhigg",
    "categoria": "autoajuda",
    "descricao": "Charles Duhigg, repórter investigativo do New York Times, mostra que a chave para o sucesso é entender como os hábitos funcionam - e como podemos transformá-los. Durante os últimos dois anos, uma jovem transformou quase todos os aspectos de sua vida. Parou de fumar, correu uma maratona e foi promovida.",
    "img": "https://http2.mlstatic.com/D_NQ_NP_925771-MLU50709867127_072022-O.webp",
    "disponibilidade": true,
    "create_at": "2024-11-18T19:03:41.701Z",
    "update_at": "2024-11-18T19:03:41.701Z"
  },
  {
    "id": "c1bf9417-2fa8-4df9-9b72-fff906ed6f7b",
    "titulo": "Código Limpo",
    "autor": "Robert C. Martin",
    "categoria": "universitario",
    "descricao": "Mesmo um código que não é ideal pode funcionar. Mas se ele não estiver adequado, pode comprometer uma empresa de desenvolvimento. Horas incontáveis e recursos significativos são perdidos anualmente devido a um código mal elaborado. O renomado especialista em software, Robert C. Martin, apresenta um paradigma com \"Códigolimpo: Habilidades Práticas do Agile Software\". Martin, junto com seus colegas do Mentor Object, destila práticas eficientes de elaboração de códigos em um livro que vai introduzir gradualmente os valores da habilidade de um profissional de softwares e ajudar a se tornar um programador melhor – mas somente com prática.",
    "img": "https://m.media-amazon.com/images/I/71dH97FwGbL._SY425_.jpg",
    "disponibilidade": true,
    "create_at": "2024-11-18T19:48:59.929Z",
    "update_at": "2024-11-18T19:48:59.929Z"
  },
  {
    "id": "ed0aa3b1-6aab-4745-b4d2-3d410dce6a85",
    "titulo": "Hábitos Atômicos",
    "autor": "James Clear",
    "categoria": "autoajuda",
    "descricao": "Não importa quais sejam seus objetivos, Hábitos Atômicos oferece um método eficaz para você se aprimorar ― todos os dias. James Clear, um dos mais expoentes especialistas na criação de hábitos, revela as estratégicas práticas que o ensinarão, exatamente, como criar bons hábitos, abandonar os maus e fazer pequenas mudanças de comportamento que levam a resultados impressionantes.",
    "img": "https://m.media-amazon.com/images/I/81eT2pjx4jL._SY425_.jpg",
    "disponibilidade": true,
    "create_at": "2024-11-18T19:52:49.273Z",
    "update_at": "2024-11-18T19:52:49.273Z"
  }
]
